{
    "Casual Conversation": {
        "Icebreaker Phrases": [
            "So, are you always this gorgeous, or is today special?",
            "What’s something fun and crazy you’ve done that I should know about?",
            "Are you the type who loves deep conversations, or should I keep it playful?",
            "Tell me something you’ve never told anyone on here.",
            "Your vibe is magnetic. What’s the secret behind it?",
            "You caught my eye for a reason. What do you think it is?",
            "What’s the wildest thing on your bucket list you still haven’t done?",
            "If I told you that smile of yours could start a revolution, would you believe me?",
            "Be honest, are you as fun as you look?",
            "What’s the one thing you’re most passionate about right now?"
        ],
        "Responses After First Reply": [
            "That’s a bold move! I love that energy—tell me more.",
            "Wow, you’re full of surprises. What made you decide to do that?",
            "Haha, that’s amazing! You’ve got a story worth hearing.",
            "Sounds like you’ve got a wild side. I like it.",
            "That’s inspiring. Do you always go all in like this?",
            "You’re not like anyone I’ve met before. What’s your secret?",
            "I have to admit, your perspective is refreshing.",
            "That’s an experience I’d love to share someday.",
            "You sound like someone who knows how to live life. Am I right?",
            "I can see why people gravitate toward you. You’re magnetic."
        ]
    },
    "Serious Relationship": {
        "Icebreaker Phrases": [
            "What’s the most meaningful compliment you’ve ever received?",
            "Do you believe in soulmates, or are we all just winging it?",
            "What’s something about relationships you’ve always wanted to understand better?",
            "If you had to define your ideal partner in three words, what would they be?",
            "What’s a tradition you’d love to create in a relationship?",
            "Do you believe in growing together or finding someone already ‘perfect’?",
            "What’s the most valuable lesson you’ve learned about love?",
            "How do you know when you’ve met someone special?",
            "Do you think chemistry or compatibility matters more in the long run?",
            "What’s the best relationship advice you’ve ever received?"
        ],
        "Responses After First Reply": [
            "That’s deep. You’ve clearly put thought into this.",
            "Wow, that’s a perspective I hadn’t considered before.",
            "You sound like someone who values meaningful connections.",
            "It’s rare to meet someone with that level of insight.",
            "You’ve got me curious. How did you come to think like that?",
            "That’s beautiful. You’re someone who sees relationships differently.",
            "You’re the kind of person who could make someone very lucky.",
            "I admire how much heart you put into your words.",
            "You’ve got depth. I’m enjoying this conversation already.",
            "That’s a refreshing take. Most people don’t see it that way."
        ]
    },
    "Casual Sex": {
        "Icebreaker Phrases": [
            "Let’s skip the small talk. What’s the wildest thought you’ve had today?",
            "On a scale of 1 to 10, how much do you enjoy breaking the rules?",
            "Be honest: are you the kind who likes to tease or take control?",
            "What’s the most unexpected compliment you’ve ever received?",
            "What’s something irresistible about you that people always notice?",
            "Do you believe in instant attraction, or is it all in the vibe?",
            "If I dared you to say your most daring thought right now, would you?",
            "What’s one thing you’ve always wanted to try but never had the courage?",
            "If confidence is sexy, how would you rate yourself?",
            "Let’s get real. What’s the best way to grab your attention?"
        ],
        "Responses After First Reply": [
            "Haha, now that’s bold. I like the way you think.",
            "That’s intriguing. You’ve got me curious—tell me more.",
            "You’re full of surprises. I didn’t see that coming.",
            "Wow, you’ve got a wild side. I can’t wait to hear more.",
            "That’s exactly the kind of energy I’m looking for.",
            "You’ve got confidence, and I’m all for it.",
            "That’s daring. I admire someone who speaks their mind.",
            "You’re not like anyone I’ve met before, and I like it.",
            "That’s bold! You’ve got my attention.",
            "You’ve got a way of keeping things interesting. Keep going."
        ]
    },
    "Just Friendships": {
        "Icebreaker Phrases": [
            "What’s a random fact about you that would surprise people?",
            "What’s the most ridiculous thing you’ve done with friends?",
            "What’s a memory that always makes you laugh?",
            "If we were to hang out, what’s the first thing you’d suggest?",
            "What’s your go-to comfort activity when you need to unwind?",
            "What’s the weirdest inside joke you’ve ever had with someone?",
            "If I told you I was a master at Mario Kart, how would you respond?",
            "What’s a hobby you’ve always wanted to try but never got around to?",
            "What’s your favorite snack to share with friends?",
            "What’s the most spontaneous thing you’ve done with a friend?"
        ],
        "Responses After First Reply": [
            "Haha, that’s hilarious. You’ve got some great stories.",
            "That sounds like an adventure! You’ve got good energy.",
            "You sound like the kind of friend everyone needs.",
            "That’s a vibe I can get behind. You’re fun to talk to.",
            "You’ve got great taste in how to spend time.",
            "I can see why people like being around you.",
            "You’ve got the kind of personality that’s hard to ignore.",
            "That’s such a cool way to see things. I’m impressed.",
            "You’ve got a way of making conversations so easy.",
            "I like your style. Let’s keep this going."
        ]
    }
}